#!/usr/bin/python
# vim: set fileencoding=utf-8

discard= {
u"page1": [u'სახელი, გვარი:',u'ფურცელი',u'სახელი',u'გვარი',u'დაბადების ადგილი',u'დაბადების რიცხვი, თვე, წელი', u'ნათესაური ან სხვაგვარი კავშირი'],

u"page2": [u'ქონების სახეობა',u'ქონების ადგილმდებარეობა, საერთო ფართობი'],

u"page3": [u'ქონების სახეობა',u'ქონების დეტალები'],

u"page4": [u'მესაკუთრის ვინაობა',u'(სახელი, გვარი)',u'ფასიანი ქაღალდის ემიტენტი',u'ფასიანი ქაღალდის სახეობა',u'ფასიანი ქაღალდის ნომინალი',u'ფასიანი ქაღალდების რაოდენობა'],

u"page5": [u'საბანკო ან/და სხვა საკრედიტო დაწესებულების',u'სახელწოდება',u'ანგარიშის ან/და შენატანის სახეობა',u'ანგარიშზე ან/და შენატანზე',u'არსებული ნაშთი (კრედიტი ან',u'დებეტი)'],

u"page6": [u'ფულადი თანხის მესაკუთრის ვინაობა (სახელი, გვარი)',u'ფულადი თანხის ოდენობა შესაბამის ვალუტაში'],

u"page7": [u'(სახელი, გვარი)',u'საწარმოს სრული საფირმო',u'სახელწოდება და იურიდიული',u'მისამართი',u'საწარმოს საქმიანობაში მონაწილეობის',u'ფორმა',u'საწარმოს მარეგისტრირებელი ორგანო',u'და რეგისტრაციის თარიღი',u'სამეწარმეო საქმიანობაში',u'მონაწილეობის დროის',u'მონაკვეთი',u'საწარმოს საქმიანობით წინა წლის',u'პირველი იანვრიდან 31 დეკემბრის',u'ჩათვლით მიღებული შემოსავალი'],

u"page8": [u'ზურაბ თალაკვაძეu',u'სამსახური, რომელშიც პირს უკავია თანამდებობა ან',u'ასრულებს სამუშაოს, ასევე რომელშიც წინა წლის პირველი',u'იანვრიდან 31 დეკემბრის ჩათვლით ეკავა თანამდებობა ან',u'ასრულებდა სამუშაოს',u'თანამდებობის დასახელება ან სამუშაოს შინაარსი',u'სამუშაოს შესრულებით წინა წლის',u'პირველი იანვრიდან 31 დეკემბრის',u'ჩათვლით მიღებული შემოსავალი'],

u"page9": [u'ხელშეკრულების სახეობა, საგანი და ღირებულება',u'ხელშეკრულების დადების თარიღი, მისი მოქმედების',u'ვადა, ორგანო, რომელმაც მოახდინა ხელშეკრულების',u'სახელმწიფო რეგისტრაცია ან დამოწმება',u'წინა წლის პირველი იანვრიდან 31',u'დეკემბრის ჩათვლით ხელშეკრულებით',u'მიღებული მატერიალური შედეგი'],

u"page10": [u'საჩუქრის მიმღები',u'საჩუქრის სახეობა და საბაზრო ღირებულება',u'გამცემის მიმღებთან კავშირი'],

u"page11": [u'შემოსავლის/გასავლის მიმღები/გამცემი პირის',u'ვინაობა (სახელი გვარი)',u'შემოსავლის ან/და გასავლის სახეობა',u'შემოსავლის ან/და გასავლის ოდენობა',u'(ღირებულება)'],
}
